app/views/days/home.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."day_id" = $1  ORDER BY start_time  [["day_id", 16]]
---
             <p>
               <% day.activities.each do |activity| %>