app/views/days/show.html.erb

        <h1>Schedule</h1>
        <% if @day.activities.any? %>
---
SELECT  1 AS one FROM "activities" WHERE "activities"."day_id" = $1 LIMIT 1  [["day_id", 12]]
SELECT "activities".* FROM "activities" WHERE "activities"."day_id" = $1  ORDER BY start_time  [["day_id", 16]]