app/controllers/activities_controller.rb

SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT 1  [["id", 12]]
---
  def new
    @day = Day.find(params[:day_id])

SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT 1  [["id", 12]]
INSERT INTO "activities" ("text", "url", "start_time", "end_time", "day_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "tester"], ["url", "https://www.facebook.com"], ["start_time", "2015-09-14 15:00:00.000000"], ["end_time", "2015-09-14 16:00:00.000000"], ["day_id", 12]]
---
  def create
    @day = Day.find(params[:day_id])
    @activity = @day.activities.new(activity_params)
      if @activity.save

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1  ORDER BY start_time LIMIT 1  [["id", 1]]
---
  def edit
    @day = Day.find(params[:day_id])
    @activity = Activity.find(params[:id])

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1  ORDER BY start_time LIMIT 1  [["id", 15]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 15]]
---
  def destroy
    @day = Day.find(params[:day_id])
    @activity = Activity.find(params[:id])
    @activity.destroy

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1  ORDER BY start_time LIMIT 1  [["id", 2]]
UPDATE "activities" SET "start_time" = $1, "end_time" = $2, "url" = $3, "text" = $4, "day_id" = $5 WHERE "activities"."id" = $6  [["start_time", "2015-09-18 13:00:00.000000"], ["end_time", "2015-09-18 19:00:00.000000"], ["url", "www.hola.cm"], ["text", "onehfndeskancd;"], ["day_id", 5], ["id", 2]]
---
  def update
    @day = Day.find(params[:day_id])
    @activity = Activity.find(params[:id])
    if @activity.update(params[:activity])