app/controllers/days_controller.rb

SELECT "days".* FROM "days"  ORDER BY published_at DESC
SELECT "activities".* FROM "activities" WHERE "activities"."day_id" = $1  ORDER BY start_time  [["day_id", 16]]
---
  def home
    @days = Day.all
    @activities = Activity.all

SELECT "days".* FROM "days" WHERE (created_at > '2015-09-10 07:00:00.000000' AND created_at < '2015-09-11 06:59:59.999999')
SELECT "activities".* FROM "activities"
---
  def index
    if params[:query].present?
      @days = Day.search(params[:query], day_params: params[:day_params])
    else
      @days = Day.all
      @activities = Activity.all

SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "activities".* FROM "activities" WHERE "activities"."day_id" = $1  ORDER BY start_time  [["day_id", 16]]
SELECT "days".* FROM "days"
---
  def show
    @day = Day.find(params[:id])
    @activities = @day.activities.all

SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @day = Day.find(params[:id])

INSERT INTO "days" ("description", "date", "link_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "test"], ["date", "2015-08-03 00:00:00.000000"], ["link_to", "www.facebook.com"], ["created_at", "2015-09-09 21:29:00.875712"], ["updated_at", "2015-09-09 21:29:00.875712"]]
---
  def create
    @day = Day.new(day_params)
    if @day.save